[Killed] BooleanLiteral
src/components/language-selector/index.tsx:10:86
 
 export default function LanguageSelector() {
     const [lng, setLng] = useState<string>('fr')
-    const { i18n } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+    const { i18n } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: true });
 
     const handleLangChange = (event: any): void =>  {
killedBy: LanguageSelector should render the language selector with default language
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "combobox"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] StringLiteral
src/components/language-selector/index.tsx:10:54
 
 export default function LanguageSelector() {
     const [lng, setLng] = useState<string>('fr')
-    const { i18n } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+    const { i18n } = useTranslation(Cookie.getCookie(""), { useSuspense: false });
 
     const handleLangChange = (event: any): void =>  {

[Killed] BlockStatement
src/components/language-selector/index.tsx:12:53
     const [lng, setLng] = useState<string>('fr')
     const { i18n } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
 
-    const handleLangChange = (event: any): void =>  {
-        const lang = event.target.value
-        i18n.changeLanguage(lang)
-        setLng(lang)
-        Cookie.setCookie("NEXT_I18LANG", lang, 180)
-    }
+    const handleLangChange = (event: any): void =>  {}
 
     useEffect(() => {
killedBy: LanguageSelector should change language when a new language is selected
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  HT
Received:
  ​

[Killed] BlockStatement
src/components/language-selector/index.tsx:19:21
         Cookie.setCookie("NEXT_I18LANG", lang, 180)
     }
 
-    useEffect(() => {
-      setLng(i18n.language)
-    }, [i18n.language])
+    useEffect(() => {}, [i18n.language])
     
   return (
killedBy: HomeController Should render HomePage with props
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `HomeController Should render HomePage with props 1`

- Snapshot  -  2
+ Received  + 13

@@ -94,14 +94,25 @@

[Survived] ArrayDeclaration
src/components/language-selector/index.tsx:21:8
 
     useEffect(() => {
       setLng(i18n.language)
-    }, [i18n.language])
+    }, [])
     
   return (

[Killed] StringLiteral
src/components/language-selector/index.tsx:30:31
             value={lng}
             onChange={handleLangChange}
             sx={{
-                borderBottom: 'none'
+                borderBottom: ""
                
             }}
killedBy: HomeController Should render HomePage with props
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `HomeController Should render HomePage with props 1`

- Snapshot  - 1
+ Received  + 1

@@ -84,11 +84,11 @@

[Killed] ArrowFunction
src/components/language-selector/index.tsx:34:29
                
             }}
         >
-        {activeLanguage.map(_lng => (
-            <MenuItem sx={{
-                display: 'flex',
-                gap: '0 16px',
-                fontSize: '8px',
-                alignItems: 'center',
-                justifyContent: 'center',
-                alignContent: 'center',
-                overflow: 'hidden'
-            }} key={_lng.value} value={_lng.value}>
-                <Image src={_lng.image} alt={_lng.name} width={20} height={12}/>
-                <span style={{fontSize: '14px', marginLeft: '8px'}}>
-                    {_lng.name}
-                </span>
-                </MenuItem>
-        ))}
+        {activeLanguage.map(() => undefined)}
         </Select>
     </FormControl>
killedBy: LanguageSelector should change language when a new language is selected
statusReason: TestingLibraryElementError: Unable to find an element with the text: HT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Survived] StringLiteral
src/components/language-selector/index.tsx:37:22
         {activeLanguage.map(_lng => (
             <MenuItem sx={{
                 display: 'flex',
-                gap: '0 16px',
+                gap: "",
                 fontSize: '8px',
                 alignItems: 'center',

[Survived] StringLiteral
src/components/language-selector/index.tsx:38:27
             <MenuItem sx={{
                 display: 'flex',
                 gap: '0 16px',
-                fontSize: '8px',
+                fontSize: "",
                 alignItems: 'center',
                 justifyContent: 'center',

[Survived] StringLiteral
src/components/language-selector/index.tsx:42:27
                 alignItems: 'center',
                 justifyContent: 'center',
                 alignContent: 'center',
-                overflow: 'hidden'
+                overflow: ""
             }} key={_lng.value} value={_lng.value}>
                 <Image src={_lng.image} alt={_lng.name} width={20} height={12}/>

[Survived] StringLiteral
src/components/language-selector/index.tsx:45:41
                 overflow: 'hidden'
             }} key={_lng.value} value={_lng.value}>
                 <Image src={_lng.image} alt={_lng.name} width={20} height={12}/>
-                <span style={{fontSize: '14px', marginLeft: '8px'}}>
+                <span style={{fontSize: "", marginLeft: '8px'}}>
                     {_lng.name}
                 </span>

[Survived] ObjectLiteral
src/components/language-selector/index.tsx:45:30
                 overflow: 'hidden'
             }} key={_lng.value} value={_lng.value}>
                 <Image src={_lng.image} alt={_lng.name} width={20} height={12}/>
-                <span style={{fontSize: '14px', marginLeft: '8px'}}>
+                <span style={{}}>
                     {_lng.name}
                 </span>
