[Survived] BooleanLiteral
src/components/navbar/index.tsx:12:83
 import NavList from './nav-list'
 import NavOptions from './nav-options'
 export const Navbar: React.FC = () => {
-    const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+    const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: true });
 
     return (

[Survived] StringLiteral
src/components/navbar/index.tsx:12:51
 import NavList from './nav-list'
 import NavOptions from './nav-options'
 export const Navbar: React.FC = () => {
-    const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+    const { t } = useTranslation(Cookie.getCookie(""), { useSuspense: false });
 
     return (

[Survived] ArrowFunction
src/components/navbar/index.tsx:21:84
                     <Image src={logo} alt="nuvann.com" />
                 </Link>
                 <div className={Styles.navbar_search}>
-                    <SearchBar placeholder={t('home.searchForAProduct')} onSearch={()=> console.log("searching")}/>
+                    <SearchBar placeholder={t('home.searchForAProduct')} onSearch={() => undefined}/>
                 </div>
                 <NavOptions user={{

[Killed] StringLiteral
src/components/navbar/index.tsx:25:29
                 </div>
                 <NavOptions user={{
                     name: "Marc",
-                    avatar: "navAvatar"
+                    avatar: ""
                 }}/>
             </div>
killedBy: HomeController Should render HomePage with props
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `HomeController Should render HomePage with props 1`

- Snapshot  -  6
+ Received  + 12

@@ -41,17 +41,23 @@
