[Survived] BooleanLiteral
components/navbar/nav-list/index.tsx:8:81
 import { useTranslation } from 'react-i18next';
 
 export default function NavList() {
-  const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+  const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: true });
   return (
     <nav className={Styles.navbar_list}>

[Survived] StringLiteral
components/navbar/nav-list/index.tsx:8:49
 import { useTranslation } from 'react-i18next';
 
 export default function NavList() {
-  const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+  const { t } = useTranslation(Cookie.getCookie(""), { useSuspense: false });
   return (
     <nav className={Styles.navbar_list}>

[Killed] StringLiteral
components/navbar/nav-list/index.tsx:12:31
   return (
     <nav className={Styles.navbar_list}>
         <ul>
-            <Link href="/">{t("navContent.home")}</Link>
+            <Link href="/">{t("")}</Link>
             <Link href="/promotions">
               {t("navContent.promotion")}
killedBy: HomeController Should render HomePage with props
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `HomeController Should render HomePage with props 1`

- Snapshot  - 3
+ Received  + 1

@@ -129,13 +129,11 @@

[Killed] StringLiteral
components/navbar/nav-list/index.tsx:20:18
               {t("navContent.category")}
             </Link>
             <Link href="/sell">
-              {t("navContent.sell")}
+              {t("")}
             </Link>
             <Link href="/category?category=man">
killedBy: HomeController Should render HomePage with props
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `HomeController Should render HomePage with props 1`

- Snapshot  - 3
+ Received  + 1

@@ -144,13 +144,11 @@
