[Survived] BooleanLiteral
components/navbar/search-bar/index.tsx:9:81
 import { SearchBarProps } from '../types';
 
 const SearchBar: React.FC<SearchBarProps> = ({ placeholder, onSearch }) => {
-  const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+  const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: true });
   const [query, setQuery] = useState<string>('');
 

[Survived] StringLiteral
components/navbar/search-bar/index.tsx:9:49
 import { SearchBarProps } from '../types';
 
 const SearchBar: React.FC<SearchBarProps> = ({ placeholder, onSearch }) => {
-  const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+  const { t } = useTranslation(Cookie.getCookie(""), { useSuspense: false });
   const [query, setQuery] = useState<string>('');
 

[Killed] BlockStatement
components/navbar/search-bar/index.tsx:12:55
   const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
   const [query, setQuery] = useState<string>('');
 
-  const debouncedSearch = debounce((query: string) => {
-    onSearch(query);
-  }, 500);
+  const debouncedSearch = debounce((query: string) => {}, 500);
 
   useEffect(() => {
killedBy: SearchBar Component should calls onSearch when button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "ButtonTest"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Survived] BlockStatement
components/navbar/search-bar/index.tsx:16:19
     onSearch(query);
   }, 500);
 
-  useEffect(() => {
-    if(query) {
-      debouncedSearch(query);
-      return debouncedSearch.cancel;
-    }
-  // eslint-disable-next-line react-hooks/exhaustive-deps
-  }, [query]);
+  useEffect(() => {}, [query]);
 
   const handleInputChange = (event: React.ChangeEvent<HTMLInputElement>) => {

[Survived] BlockStatement
components/navbar/search-bar/index.tsx:17:15
   }, 500);
 
   useEffect(() => {
-    if(query) {
-      debouncedSearch(query);
-      return debouncedSearch.cancel;
-    }
+    if(query) {}
   // eslint-disable-next-line react-hooks/exhaustive-deps
   }, [query]);

[Survived] ConditionalExpression
components/navbar/search-bar/index.tsx:17:8
   }, 500);
 
   useEffect(() => {
-    if(query) {
+    if(false) {
       debouncedSearch(query);
       return debouncedSearch.cancel;

[Killed] BlockStatement
components/navbar/search-bar/index.tsx:24:77
   // eslint-disable-next-line react-hooks/exhaustive-deps
   }, [query]);
 
-  const handleInputChange = (event: React.ChangeEvent<HTMLInputElement>) => {
-    setQuery(event.target.value);
-  };
+  const handleInputChange = (event: React.ChangeEvent<HTMLInputElement>) => {};
 
   const handleButtonClick = () => {
killedBy: SearchBar Component should calls onSearch when button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "ButtonTest"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Survived] BlockStatement
components/navbar/search-bar/index.tsx:28:35
     setQuery(event.target.value);
   };
 
-  const handleButtonClick = () => {
-    debouncedSearch(query);
-  };
+  const handleButtonClick = () => {};
 
   return (
