[NoCoverage] BlockStatement
src/pages/_app.tsx:10:65
 import '../styles/globals.scss'
 
 import "@/utils/i18starter/index"
-export default function App({ Component, pageProps }: AppProps) {
-  return (
-    <>
-      <style jsx global>{`
-      html {
-        font-family: ${inter.style.fontFamily};
-      }
-    `}</style>
-      
-      <Component {...pageProps}/>;
-    </>
-)
-  
-}
+export default function App({ Component, pageProps }: AppProps) {}
 
