[Killed] BlockStatement
home/components/hero/index.tsx:14:25
 const Hero: React.FC<HeroProps> = ({ images, autoSlideInterval }) => {
   const [currentSlide, setCurrentSlide] = React.useState(0);
 
-  React.useEffect(() => {
-    const interval = setInterval(() => {
-      setCurrentSlide((prevSlide) => (prevSlide + 1) % images.length);
-    }, autoSlideInterval);
-
-    return () => clearInterval(interval);
-  }, [images.length, autoSlideInterval]);
+  React.useEffect(() => {}, [images.length, autoSlideInterval]);
 
   const handlePrevSlide = () => {
killedBy: Hero useEffect sets up and cleans up interval correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] BlockStatement
home/components/hero/index.tsx:15:40
   const [currentSlide, setCurrentSlide] = React.useState(0);
 
   React.useEffect(() => {
-    const interval = setInterval(() => {
-      setCurrentSlide((prevSlide) => (prevSlide + 1) % images.length);
-    }, autoSlideInterval);
+    const interval = setInterval(() => {}, autoSlideInterval);
 
     return () => clearInterval(interval);

[Survived] ArithmeticOperator
home/components/hero/index.tsx:16:38
 
   React.useEffect(() => {
     const interval = setInterval(() => {
-      setCurrentSlide((prevSlide) => (prevSlide + 1) % images.length);
+      setCurrentSlide((prevSlide) => (prevSlide + 1) * images.length);
     }, autoSlideInterval);
 

[Survived] ArithmeticOperator
home/components/hero/index.tsx:16:39
 
   React.useEffect(() => {
     const interval = setInterval(() => {
-      setCurrentSlide((prevSlide) => (prevSlide + 1) % images.length);
+      setCurrentSlide((prevSlide) => (prevSlide - 1) % images.length);
     }, autoSlideInterval);
 

[Survived] BlockStatement
home/components/hero/index.tsx:22:33
     return () => clearInterval(interval);
   }, [images.length, autoSlideInterval]);
 
-  const handlePrevSlide = () => {
-    setCurrentSlide((prevSlide) => (prevSlide - 1 + images.length) % images.length);
-  };
+  const handlePrevSlide = () => {};
 
   const handleNextSlide = () => {

[Survived] ArithmeticOperator
home/components/hero/index.tsx:23:36
   }, [images.length, autoSlideInterval]);
 
   const handlePrevSlide = () => {
-    setCurrentSlide((prevSlide) => (prevSlide - 1 + images.length) % images.length);
+    setCurrentSlide((prevSlide) => (prevSlide - 1 + images.length) * images.length);
   };
 

[Survived] ArithmeticOperator
home/components/hero/index.tsx:23:37
   }, [images.length, autoSlideInterval]);
 
   const handlePrevSlide = () => {
-    setCurrentSlide((prevSlide) => (prevSlide - 1 + images.length) % images.length);
+    setCurrentSlide((prevSlide) => (prevSlide - 1 - images.length) % images.length);
   };
 

[Survived] BlockStatement
home/components/hero/index.tsx:26:33
     setCurrentSlide((prevSlide) => (prevSlide - 1 + images.length) % images.length);
   };
 
-  const handleNextSlide = () => {
-    setCurrentSlide((prevSlide) => (prevSlide + 1) % images.length);
-  };
+  const handleNextSlide = () => {};
   return (
     <div className={Styles.carousel}>

[Survived] ArithmeticOperator
home/components/hero/index.tsx:27:37
   };
 
   const handleNextSlide = () => {
-    setCurrentSlide((prevSlide) => (prevSlide + 1) % images.length);
+    setCurrentSlide((prevSlide) => (prevSlide - 1) % images.length);
   };
   return (

[Survived] ArithmeticOperator
home/components/hero/index.tsx:27:36
   };
 
   const handleNextSlide = () => {
-    setCurrentSlide((prevSlide) => (prevSlide + 1) % images.length);
+    setCurrentSlide((prevSlide) => (prevSlide + 1) * images.length);
   };
   return (

[Survived] ArithmeticOperator
home/components/hero/index.tsx:31:75
   };
   return (
     <div className={Styles.carousel}>
-      <div className={Styles.__slider} style={{ transform: `translateX(-${currentSlide * 100}%)` }}>
+      <div className={Styles.__slider} style={{ transform: `translateX(-${currentSlide / 100}%)` }}>
         {images.map((image, index) => (
           <div key={index} className={Styles.__slide}>

[Killed] StringLiteral
home/components/hero/index.tsx:31:60
   };
   return (
     <div className={Styles.carousel}>
-      <div className={Styles.__slider} style={{ transform: `translateX(-${currentSlide * 100}%)` }}>
+      <div className={Styles.__slider} style={{ transform: `` }}>
         {images.map((image, index) => (
           <div key={index} className={Styles.__slide}>
killedBy: HomeController Should render HomePage with props
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `HomeController Should render HomePage with props 1`

- Snapshot  - 1
+ Received  + 0

@@ -169,11 +169,10 @@

[Killed] ArrowFunction
home/components/hero/index.tsx:32:21
   return (
     <div className={Styles.carousel}>
       <div className={Styles.__slider} style={{ transform: `translateX(-${currentSlide * 100}%)` }}>
-        {images.map((image, index) => (
-          <div key={index} className={Styles.__slide}>
-            <Image src={image} alt={`Slide ${index + 1}`} />
-          </div>
-        ))}
+        {images.map(() => undefined)}
       </div>
       <button aria-label='_prev' name='_prev' className={Styles.__prev_btn} onClick={handlePrevSlide}>
killedBy: HomeController Should render HomePage with props
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `HomeController Should render HomePage with props 1`

- Snapshot  - 92
+ Received  +  1

@@ -170,102 +170,11 @@

[Killed] ArithmeticOperator
home/components/hero/index.tsx:34:46
       <div className={Styles.__slider} style={{ transform: `translateX(-${currentSlide * 100}%)` }}>
         {images.map((image, index) => (
           <div key={index} className={Styles.__slide}>
-            <Image src={image} alt={`Slide ${index + 1}`} />
+            <Image src={image} alt={`Slide ${index - 1}`} />
           </div>
         ))}
killedBy: Hero renders images correctly
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: Slide 5

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="carousel"
    >
