[Survived] BooleanLiteral
pages/home/view/home.view.tsx:8:81
 import { HomeProps } from '../types';
 
 export default function Home(props: Readonly<HomeProps>) {
-  const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+  const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: true });
   return (
     <>

[Survived] StringLiteral
pages/home/view/home.view.tsx:8:49
 import { HomeProps } from '../types';
 
 export default function Home(props: Readonly<HomeProps>) {
-  const { t } = useTranslation(Cookie.getCookie("NEXT_I18LANG"), { useSuspense: false });
+  const { t } = useTranslation(Cookie.getCookie(""), { useSuspense: false });
   return (
     <>
