[Killed] BlockStatement
src/utils/cookie/index.tsx:2:58
 class Cookie {
-    setCookie(name: string, value: string, days: number) {
-        let expires = "";
-        if (days) {
-            let date = new Date();
-            date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
-            expires = "; expires=" + date.toUTCString();
-        }
-        document.cookie = name + "=" + (value || "") + expires + "; path=/";
-    }
+    setCookie(name: string, value: string, days: number) {}
 
     getCookie(name: string) {
killedBy: Cookie Utilities setCookie sets a cookie with a given name and value
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /testCookie=testValue/
Received string:  ""

[Survived] StringLiteral
src/utils/cookie/index.tsx:3:23
 class Cookie {
     setCookie(name: string, value: string, days: number) {
-        let expires = "";
+        let expires = "Stryker was here!";
         if (days) {
             let date = new Date();

[Survived] ConditionalExpression
src/utils/cookie/index.tsx:4:13
 class Cookie {
     setCookie(name: string, value: string, days: number) {
         let expires = "";
-        if (days) {
+        if (true) {
             let date = new Date();
             date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));

[Survived] BlockStatement
src/utils/cookie/index.tsx:4:19
 class Cookie {
     setCookie(name: string, value: string, days: number) {
         let expires = "";
-        if (days) {
-            let date = new Date();
-            date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
-            expires = "; expires=" + date.toUTCString();
-        }
+        if (days) {}
         document.cookie = name + "=" + (value || "") + expires + "; path=/";
     }

[Killed] ArithmeticOperator
src/utils/cookie/index.tsx:6:26
         let expires = "";
         if (days) {
             let date = new Date();
-            date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
+            date.setTime(date.getTime() - days * 24 * 60 * 60 * 1000);
             expires = "; expires=" + date.toUTCString();
         }
killedBy: Cookie Utilities setCookie sets a cookie with a given name and value
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /testCookie=testValue/
Received string:  ""

[Survived] ArithmeticOperator
src/utils/cookie/index.tsx:6:44
         let expires = "";
         if (days) {
             let date = new Date();
-            date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
+            date.setTime(date.getTime() + (days * 24 * 60 / 60 * 1000));
             expires = "; expires=" + date.toUTCString();
         }

[Killed] ConditionalExpression
src/utils/cookie/index.tsx:9:41
             date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
             expires = "; expires=" + date.toUTCString();
         }
-        document.cookie = name + "=" + (value || "") + expires + "; path=/";
+        document.cookie = name + "=" + (true) + expires + "; path=/";
     }
 
killedBy: Cookie Utilities setCookie sets a cookie with a given name and value
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /testCookie=testValue/
Received string:  "testCookie=true"

[Killed] ConditionalExpression
src/utils/cookie/index.tsx:9:41
             date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
             expires = "; expires=" + date.toUTCString();
         }
-        document.cookie = name + "=" + (value || "") + expires + "; path=/";
+        document.cookie = name + "=" + (false) + expires + "; path=/";
     }
 
killedBy: Cookie Utilities setCookie sets a cookie with a given name and value
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /testCookie=testValue/
Received string:  "testCookie=false"

[Killed] EqualityOperator
src/utils/cookie/index.tsx:13:13
     }
 
     getCookie(name: string) {
-        if (typeof window !== 'undefined') {
+        if (typeof window === 'undefined') {
             const cookieValue = RegExp('(^|;)\\s*' + name + '\\s*=\\s*([^;]+)').exec(document.cookie);
             return cookieValue ? cookieValue.pop() : '';
killedBy: Cookie Utilities getCookie should return the value of the cookie with the given name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "testValue"
Received: ""

[Killed] BlockStatement
src/utils/cookie/index.tsx:13:44
     }
 
     getCookie(name: string) {
-        if (typeof window !== 'undefined') {
-            const cookieValue = RegExp('(^|;)\\s*' + name + '\\s*=\\s*([^;]+)').exec(document.cookie);
-            return cookieValue ? cookieValue.pop() : '';
-        } else {
+        if (typeof window !== 'undefined') {} else {
             return '';
         }
killedBy: Cookie Utilities getCookie should return the value of the cookie with the given name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "testValue"
Received: undefined

[Killed] BlockStatement
src/utils/cookie/index.tsx:16:16
         if (typeof window !== 'undefined') {
             const cookieValue = RegExp('(^|;)\\s*' + name + '\\s*=\\s*([^;]+)').exec(document.cookie);
             return cookieValue ? cookieValue.pop() : '';
-        } else {
-            return '';
-        }
+        } else {}
     }
 
killedBy: Cookie Utilities getCookie should return an empty string for undefined cookie
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] BlockStatement
src/utils/cookie/index.tsx:21:32
         }
     }
 
-    deleteCookie(name: string) {
-        document.cookie = name + '=; Max-Age=-99999999;';
-    }
+    deleteCookie(name: string) {}
 }
 
killedBy: Cookie Utilities deleteCookie should delete the cookie with the given name
statusReason: Error: expect(received).toBeUndefined()

Received: "testValue"

[Survived] StringLiteral
src/utils/cookie/index.tsx:22:34
     }
 
     deleteCookie(name: string) {
-        document.cookie = name + '=; Max-Age=-99999999;';
+        document.cookie = name + "";
     }
 }
