[Survived] ObjectLiteral
src/utils/i18starter/index.ts:9:11
 i18next
     .use(initReactI18next)
     .use(Backend)
-    .init({
-        lng: Cookie.getCookie("NEXT_I18LANG"),
-        fallbackLng: "en",
-        backend: {
-            loadPath: '/translations/{{lng}}/translations.json'
-        }
-    })
+    .init({})
 export default i18next;

[Survived] StringLiteral
src/utils/i18starter/index.ts:10:31
     .use(initReactI18next)
     .use(Backend)
     .init({
-        lng: Cookie.getCookie("NEXT_I18LANG"),
+        lng: Cookie.getCookie(""),
         fallbackLng: "en",
         backend: {
